rednblkx/HomeKey-ESP32/managed_components/espressif__esp_insights/src/esp_insights.c
// Copyright 2021 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <string.h>
#include <esp_log.h>
#include <esp_wifi.h>
#include <esp_core_dump.h>
#include <freertos/FreeRTOS.h>
#include <freertos/timers.h>
#include <nvs.h>
#include <esp_crc.h>
#include <freertos/semphr.h>
#include <esp_diag_data_store.h>
#include <esp_diagnostics.h>
#include <esp_diagnostics_metrics.h>
#include <esp_diagnostics_variables.h>
#include <esp_diagnostics_system_metrics.h>
#include <esp_diagnostics_network_variables.h>
#include <esp_rmaker_utils.h>
#include <esp_rmaker_factory.h>
#include <esp_rmaker_work_queue.h>
#include <esp_insights.h>
#include <esp_insights_internal.h>

#include "esp_insights_client_data.h"
#include "esp_insights_encoder.h"
#include "esp_insights_cbor_decoder.h"

#include <esp_idf_version.h>
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include <esp_mac.h>
#endif

#define INSIGHTS_DEBUG_ENABLED      CONFIG_ESP_INSIGHTS_DEBUG_ENABLED
#define APP_ELF_SHA256_LEN          (CONFIG_APP_RETRIEVE_LEN_ELF_SHA + 1)

#if CONFIG_ESP_INSIGHTS_CLOUD_POST_MIN_INTERVAL_SEC > CONFIG_ESP_INSIGHTS_CLOUD_POST_MAX_INTERVAL_SEC
#error "CONFIG_ESP_INSIGHTS_CLOUD_POST_MIN_INTERVAL_SEC must be less than or equal to CONFIG_ESP_INSIGHTS_CLOUD_POST_MAX_INTERVAL_SEC"
#endif

#define CLOUD_REPORTING_PERIOD_MIN_SEC    CONFIG_ESP_INSIGHTS_CLOUD_POST_MIN_INTERVAL_SEC
#define CLOUD_REPORTING_PERIOD_MAX_SEC    CONFIG_ESP_INSIGHTS_CLOUD_POST_MAX_INTERVAL_SEC
#define CLOUD_REPORTING_TIMEOUT_TICKS     ((30 * 1000) / portTICK_PERIOD_MS)

#ifdef CONFIG_DIAG_DATA_STORE_RTC
#if CONFIG_RTC_STORE_DATA_SIZE > (1024 * 4)
#define INSIGHTS_DATA_MAX_SIZE  (CONFIG_RTC_STORE_DATA_SIZE - 1024)
#else
#define INSIGHTS_DATA_MAX_SIZE  CONFIG_RTC_STORE_DATA_SIZE
#endif
#else
/* TODO: Hardcoding it to 6K but needs to think about clearer way to define this */
#define INSIGHTS_DATA_MAX_SIZE (1024 * 6)
#endif

#define INSIGHTS_READ_BUF_SIZE  (1024)  // read this much data from data store in one go

#define SEND_INSIGHTS_META (CONFIG_DIAG_ENABLE_METRICS || CONFIG_DIAG_ENABLE_VARIABLES)
#define KEY_LOG_WR_FAIL    "log_wr_fail"

#define DIAG_DATA_STORE_CRC_KEY "rtc_buf_sha"
#define INSIGHTS_NVS_NAMESPACE "storage"

ESP_EVENT_DEFINE_BASE(INSIGHTS_EVENT);

typedef struct esp_insights_entry {
    esp_rmaker_work_fn_t work_fn;
    TimerHandle_t timer;
    uint32_t min_seconds;
    uint32_t max_seconds;
    uint32_t cur_seconds;
    void *priv_data;
} esp_insights_entry_t;

typedef struct {
    uint8_t *scratch_buf;
    uint8_t *read_buf;      // buffer to hold data read from RTC buf
    int data_msg_id;
    uint32_t data_msg_len;
    SemaphoreHandle_t data_lock;
    char app_sha256[APP_ELF_SHA256_LEN];
    bool data_sent;
#if SEND_INSIGHTS_META
    bool meta_msg_pending;
    uint32_t meta_msg_id;
    uint32_t meta_crc;
#endif /* SEND_INSIGHTS_META */
    bool data_send_inprogress;
    uint32_t log_write_fail_cnt; /* Count of failed log write */
    TimerHandle_t data_send_timer; /* timer to reset data_send_inprogress flag on timeout */
    char *node_id;
    int boot_msg_id;   /* To track whether first message is sent or not, -1:failed, 0:success, >0:inprogress */
    bool init_done;     /* insights init done */
    bool enabled;       /* insights enable is done */
} esp_insights_data_t;

#ifdef CONFIG_ESP_INSIGHTS_ENABLED

static const char *TAG = "esp_insights";
static esp_insights_data_t s_insights_data;
static esp_insights_entry_t *s_periodic_insights_entry;

static void esp_insights_first_call(void *priv_data)
{
    if (!priv_data) {
        return;
    }
    esp_insights_entry_t *entry = (esp_insights_entry_t *)priv_data;
    esp_rmaker_work_queue_add_task(entry->work_fn, entry->priv_data);
    /* Start timer here so that the function is called periodically */
    ESP_LOGI(TAG, "Scheduling Insights timer for %" PRIu32 " seconds.", entry->cur_seconds);
    xTimerStart(entry->timer, 0);
}

/* Returns true if wifi is connected and insights is enabled, false otherwise */
static bool is_insights_active(void)
{
    wifi_ap_record_t ap_info;
    bool wifi_connected = esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK;
    return wifi_connected && s_insights_data.enabled;
}

/* This executes in the context of timer task.
 *
 * There is a dynamic logic to decide the next instance when the insights
 * data will be reported. Depending on whether data was sent or not during
 * the previous timeout, we double or halve the time period.
 * This ensures that data generally gets reported quick enough,
 * but if there's very frequent data being generated, it wont result
 * into too frquent publishes.
 * The period will keep changing between CLOUD_REPORTING_PERIOD_MIN_SEC and
 * CLOUD_REPORTING_PERIOD_MAX_SEC
 */
static void esp_insights_common_cb(TimerHandle_t handle)
{
    esp_insights_entry_t *entry = (esp_insights_entry_t *)pvTimerGetTimerID(handle);
    /* Check if any data was sent during the previous time out */
    xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
    bool l_data_sent = s_insights_data.data_sent;
    s_insights_data.data_sent = false;
    xSemaphoreGive(s_insights_data.data_lock);

    if (entry) {
        if (is_insights_active() == true) {
            esp_rmaker_work_queue_add_task(entry->work_fn, entry->priv_data);
        }
        /* If data was sent during previous timer interval, double the period */
        if (l_data_sent) {
            entry->cur_seconds <<= 1; /* Double the period */
            if (entry->cur_seconds > entry->max_seconds) {
                entry->cur_seconds = entry->max_seconds;
            }
        } else {
            /* If no data was sent during previous timer interval, halve the period */
            entry->cur_seconds >>= 1; /* Halve the period */
            if (entry->cur_seconds < entry->min_seconds) {
                entry->cur_seconds = entry->min_seconds;
            }
        }
        xTimerChangePeriod(handle, (entry->cur_seconds * 1000)/ portTICK_PERIOD_MS, 100);
        xTimerStart(handle, 0);
    }
}

static esp_err_t esp_insights_unregister_periodic_handler(void)
{
    if (s_periodic_insights_entry) {
        if (s_periodic_insights_entry->timer) {
            ESP_LOGI(TAG, "Deleting the periodic timer");
            if (xTimerDelete(s_periodic_insights_entry->timer, 10) != pdPASS) {
                ESP_LOGE(TAG, "Failed to delete the periodic timer");
            }
        }

        if (s_periodic_insights_entry) {
            free(s_periodic_insights_entry);
            s_periodic_insights_entry = NULL;
        }
    }

    return ESP_OK;
}

static esp_err_t esp_insights_register_periodic_handler(esp_rmaker_work_fn_t work_fn,
                                                        uint32_t min_seconds, uint32_t max_seconds,
                                                        void *priv_data)
{
    if (s_periodic_insights_entry) {
        ESP_LOGI(TAG, "s_periodic_insights_entry already registered");
        return ESP_OK;
    }

    if (!work_fn || (min_seconds == 0) || (max_seconds == 0)) {
        ESP_LOGI(TAG, "invalid params register_periodic_handler");
        return ESP_ERR_INVALID_ARG;
    }

    s_periodic_insights_entry = calloc (1, sizeof(esp_insights_entry_t));
    if (!s_periodic_insights_entry) {
        ESP_LOGI(TAG, "allocation failed, line %d", __LINE__);
        return ESP_ERR_NO_MEM;
    }
    s_periodic_insights_entry->work_fn = work_fn;
    s_periodic_insights_entry->priv_data = priv_data;
    s_periodic_insights_entry->min_seconds = min_seconds;
    s_periodic_insights_entry->max_seconds = max_seconds;
    s_periodic_insights_entry->cur_seconds = min_seconds;
    s_periodic_insights_entry->timer = xTimerCreate("test", (s_periodic_insights_entry->cur_seconds * 1000)/ portTICK_PERIOD_MS,
                                                    pdFALSE, (void *)s_periodic_insights_entry, esp_insights_common_cb);
    if (!s_periodic_insights_entry->timer) {
        ESP_LOGI(TAG, "timer creation failed, line %d", __LINE__);
        free(s_periodic_insights_entry);
        return ESP_FAIL;
    }
    /* Rainmaker work queue execution start after MQTT connection is established,
     * esp_insights_first_call() will be executed after MQTT connection is established.
     * It add the work_fn to the queue and start the periodic timer.
     */
    esp_err_t ret = esp_rmaker_work_queue_add_task(esp_insights_first_call, s_periodic_insights_entry);
    if (ret != ESP_OK) {
        ESP_LOGI(TAG, "failed to enqueue insights_first_call, line %d", __LINE__);
    }
    return ret;
}

static void data_send_timeout_cb(TimerHandle_t handle)
{
    xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
    s_insights_data.data_send_inprogress = false;
    if (s_insights_data.boot_msg_id > 0) {
        s_insights_data.boot_msg_id = -1;
    }
    xSemaphoreGive(s_insights_data.data_lock);
}

/* This executes in the context of default event loop task */
static void insights_event_handler(void* arg, esp_event_base_t event_base,
                                   int32_t event_id, void* event_data)
{
    esp_insights_transport_event_data_t *data = event_data;
    if (event_base != INSIGHTS_EVENT) {
        return;
    }
    switch(event_id) {
        case INSIGHTS_EVENT_TRANSPORT_SEND_SUCCESS:
#if INSIGHTS_DEBUG_ENABLED
            ESP_LOGI(TAG, "Data send success, msg_id:%d.", data ? data->msg_id : 0);
#endif
            if (data && data->msg_id) {
                xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
                if (xTimerIsTimerActive(s_insights_data.data_send_timer) == pdTRUE) {
                    xTimerStop(s_insights_data.data_send_timer, portMAX_DELAY);
                }
                if (data->msg_id == s_insights_data.data_msg_id) {
                    esp_diag_data_store_critical_release(s_insights_data.data_msg_len);
                    s_insights_data.data_sent = true;
                    s_insights_data.data_send_inprogress = false;
#if SEND_INSIGHTS_META
                } else if (s_insights_data.meta_msg_pending && data->msg_id == s_insights_data.meta_msg_id) {
                    esp_insights_meta_nvs_crc_set(s_insights_data.meta_crc);
                    s_insights_data.meta_msg_pending = false;
                    s_insights_data.data_sent = true;
#endif /* SEND_INSIGHTS_META */
                } else if (s_insights_data.boot_msg_id > 0 && s_insights_data.boot_msg_id == data->msg_id) {
#if CONFIG_ESP_INSIGHTS_COREDUMP_ENABLE
                    esp_core_dump_image_erase();
#endif // CONFIG_ESP_INSIGHTS_COREDUMP_ENABLE
                    s_insights_data.boot_msg_id = 0;
                }
                xSemaphoreGive(s_insights_data.data_lock);
            }
            break;
        case INSIGHTS_EVENT_TRANSPORT_SEND_FAILED:
            xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
            if (xTimerIsTimerActive(s_insights_data.data_send_timer) == pdTRUE) {
                xTimerStop(s_insights_data.data_send_timer, portMAX_DELAY);
            }
            s_insights_data.data_send_inprogress = false;
            if (s_insights_data.boot_msg_id > 0 && data->msg_id == s_insights_data.boot_msg_id) {
                s_insights_data.boot_msg_id = -1;
            }
            xSemaphoreGive(s_insights_data.data_lock);
            break;
        default:
            break;
    }
}

