rednblkx/HomeKey-ESP32/managed_components/espressif__esp_insights/src/esp_insights.c
#if INSIGHTS_DEBUG_ENABLED
#ifndef CONFIG_ESP_INSIGHTS_DEBUG_PRINT_JSON
static void hex_dump(uint8_t *data, uint32_t len)
{
    int index;
    for (index = 0; index < len; index++) {
        if ((index % 16) == 0) {
            printf("\n");
        }
        printf("0x%02x ", s_insights_data.scratch_buf[index]);
    }
    printf("\n");
}
#endif

static void insights_dbg_dump(uint8_t *data, uint32_t len)
{
#if CONFIG_ESP_INSIGHTS_DEBUG_PRINT_JSON
    esp_insights_cbor_decode_dump((const uint8_t *) (s_insights_data.scratch_buf + 3), len - 3);
#else
    hex_dump(data, len);
#endif
}
#endif /* INSIGHTS_DEBUG_ENABLED */

static void send_boottime_data(void)
{
    uint16_t len = 0;
    esp_insights_encode_data_begin(s_insights_data.scratch_buf, INSIGHTS_DATA_MAX_SIZE);
    esp_insights_encode_boottime_data();
    len = esp_insights_encode_data_end(s_insights_data.scratch_buf);
    if (len == 0) {
        ESP_LOGE(TAG, "No boottime data to send");
        s_insights_data.boot_msg_id = 0; // mark it sent
    }
#if INSIGHTS_DEBUG_ENABLED
    ESP_LOGI(TAG, "Sending boottime data of length: %d", len);
    insights_dbg_dump(s_insights_data.scratch_buf, len);
#endif
    int msg_id = esp_insights_transport_data_send(s_insights_data.scratch_buf, len);
    s_insights_data.boot_msg_id = msg_id;
    if (msg_id > 0) {
        return;
    } else if (msg_id == 0) {
#if CONFIG_ESP_INSIGHTS_COREDUMP_ENABLE
        esp_core_dump_image_erase();
#endif // CONFIG_ESP_INSIGHTS_COREDUMP_ENABLE
    } else {
#if INSIGHTS_DEBUG_ENABLED
        ESP_LOGI(TAG, "boottime_data message send failed");
#endif
    }
}

#if SEND_INSIGHTS_META
/* Returns true if ESP Insights metadata CRC is changed */
static bool insights_meta_changed(void)
{
    uint32_t nvs_crc;
    uint32_t meta_crc = esp_diag_meta_crc_get();
    esp_err_t err = esp_insights_meta_nvs_crc_get(&nvs_crc);
    if (err == ESP_OK && nvs_crc == meta_crc) {
        /* crc found and matched, no need to send insights meta */
        return false;
    }
    ESP_LOGI(TAG, "Insights metrics metadata changed");
    s_insights_data.meta_crc = meta_crc;
    return true;
}

static void send_insights_meta(void)
{
    uint16_t len = 0;

    memset(s_insights_data.scratch_buf, 0, INSIGHTS_DATA_MAX_SIZE);
    len = esp_insights_encode_meta(s_insights_data.scratch_buf, INSIGHTS_DATA_MAX_SIZE, s_insights_data.app_sha256);
    if (len == 0) {
#if INSIGHTS_DEBUG_ENABLED
        ESP_LOGI(TAG, "No metadata to send");
#endif
        return;
    }
#if INSIGHTS_DEBUG_ENABLED
    ESP_LOGI(TAG, "Insights meta data length %d", len);
    insights_dbg_dump(s_insights_data.scratch_buf, len);
#endif
    int msg_id = esp_insights_transport_data_send(s_insights_data.scratch_buf, len);
    if (msg_id > 0) {
        xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
        s_insights_data.meta_msg_pending = true;
        s_insights_data.meta_msg_id = msg_id;
        xSemaphoreGive(s_insights_data.data_lock);
    } else if (msg_id == 0) {
        esp_insights_meta_nvs_crc_set(s_insights_data.meta_crc);
    } else {
#if INSIGHTS_DEBUG_ENABLED
        ESP_LOGI(TAG, "meta message send failed");
#endif
    }
}
#endif /* SEND_INSIGHTS_META */

/* Consider 100 bytes are published and received on cloud but RMAKER_MQTT_EVENT_PUBLISHED
 * event is not received for 100 bytes. In a mean time 50 bytes are added to the buffer.
 * When the next time timer expires then old 100 bytes plus new 50 bytes will be published
 * and if RMAKER_MQTT_EVENT_PUBLISHED event is recieve for the new message then 150 bytes
 * will be removed from the buffers.
 *
 * In short, there is the possibility of data duplication, so cloud should be able to handle it.
 */

/* This encodes and sends insights data */
static void send_insights_data(void)
{
    uint16_t len = 0;
    size_t critical_data_size = 0;
    size_t non_critical_data_size = 0;
    size_t critical_consumed = 0;
    size_t non_critical_consumed = 0;

    memset(s_insights_data.scratch_buf, 0, INSIGHTS_DATA_MAX_SIZE);

#if CONFIG_DIAG_ENABLE_VARIABLES
    static uint32_t prev_log_write_fail_cnt = 0;
    if (s_insights_data.log_write_fail_cnt > prev_log_write_fail_cnt) {
        prev_log_write_fail_cnt = s_insights_data.log_write_fail_cnt;
        esp_diag_variable_add_uint(KEY_LOG_WR_FAIL, prev_log_write_fail_cnt);
    }
#endif /* CONFIG_DIAG_ENABLE_VARIABLES */

    esp_insights_encode_data_begin(s_insights_data.scratch_buf, INSIGHTS_DATA_MAX_SIZE);

    critical_data_size = esp_diag_data_store_critical_read(s_insights_data.read_buf, INSIGHTS_READ_BUF_SIZE);
    if (critical_data_size > 0) {
        critical_consumed = esp_insights_encode_critical_data(s_insights_data.read_buf, critical_data_size);
    }

    non_critical_data_size = esp_diag_data_store_non_critical_read(s_insights_data.read_buf, INSIGHTS_READ_BUF_SIZE);
    if (non_critical_data_size > 0) {
        non_critical_consumed = esp_insights_encode_non_critical_data(s_insights_data.read_buf, non_critical_data_size);
        esp_diag_data_store_non_critical_release(non_critical_consumed);
    }
    len = esp_insights_encode_data_end(s_insights_data.scratch_buf);
    if (!critical_consumed && !non_critical_consumed) {
        len = 0; // just ignore the encoded data
    }

    if (len == 0) {
#if INSIGHTS_DEBUG_ENABLED
        ESP_LOGI(TAG, "No data to send");
#endif
        goto data_send_end;
    }
#if INSIGHTS_DEBUG_ENABLED
    ESP_LOGI(TAG, "Sending data of length: %d", len);
    insights_dbg_dump(s_insights_data.scratch_buf, len);
#endif
    int msg_id = esp_insights_transport_data_send(s_insights_data.scratch_buf, len);
    if (msg_id > 0) {
        xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
        s_insights_data.data_msg_len = critical_consumed;
        s_insights_data.data_msg_id = msg_id;
        xTimerReset(s_insights_data.data_send_timer, portMAX_DELAY);
        xSemaphoreGive(s_insights_data.data_lock);
        return;
    } else if (msg_id == 0) {
        esp_diag_data_store_critical_release(critical_consumed);
        s_insights_data.data_sent = true;
    } else {
#if INSIGHTS_DEBUG_ENABLED
        ESP_LOGI(TAG, "insights_data message send failed");
#endif
    }
data_send_end:
    xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
    s_insights_data.data_send_inprogress = false;
    xSemaphoreGive(s_insights_data.data_lock);
}

static void insights_periodic_handler(void *priv_data)
{
    xSemaphoreTake(s_insights_data.data_lock, portMAX_DELAY);
    /* Return if wifi is disconnected */
    if (is_insights_active() == false) {
        s_insights_data.data_send_inprogress = false;
        xSemaphoreGive(s_insights_data.data_lock);
        return;
    }
    if (s_insights_data.data_send_inprogress) {
        xSemaphoreGive(s_insights_data.data_lock);
        return;
    }
    s_insights_data.data_send_inprogress = true;
    xSemaphoreGive(s_insights_data.data_lock);
#if SEND_INSIGHTS_META
    if (insights_meta_changed()) {
        send_insights_meta();
    }
#endif /* SEND_INSIGHTS_META */
    if (s_insights_data.boot_msg_id == -1) {
        send_boottime_data();
    }
    send_insights_data();
}

esp_err_t esp_insights_send_data(void)
{
    if (is_insights_active() == true) {
        ESP_LOGI(TAG, "Sending data to cloud");
        return esp_rmaker_work_queue_add_task(insights_periodic_handler, NULL);
    }
    ESP_LOGW(TAG, "Wi-Fi not in connected state");
    return ESP_FAIL;
}

