rednblkx/HomeKey-ESP32/managed_components/espressif__esp_insights/src/esp_insights.c
static void data_store_event_handler(void* arg, esp_event_base_t event_base,
                                    int32_t event_id, void* event_data)
{
    if (event_base != ESP_DIAG_DATA_STORE_EVENT) {
        return;
    }
    switch(event_id) {
        case ESP_DIAG_DATA_STORE_EVENT_CRITICAL_DATA_LOW_MEM:
        case ESP_DIAG_DATA_STORE_EVENT_NON_CRITICAL_DATA_LOW_MEM:
        {
#if INSIGHTS_DEBUG_ENABLED
            ESP_LOGI(TAG, "ESP_DIAG_DATA_STORE_EVENT_%sCRITICAL_DATA_LOW_MEM",
                    event_id == ESP_DIAG_DATA_STORE_EVENT_CRITICAL_DATA_LOW_MEM ? "" : "NON_");
#endif
            if (is_insights_active() == true) {
                esp_rmaker_work_queue_add_task(insights_periodic_handler, NULL);
            }
            break;
        }

        case ESP_DIAG_DATA_STORE_EVENT_CRITICAL_DATA_WRITE_FAIL:
            s_insights_data.log_write_fail_cnt++;
#if INSIGHTS_DEBUG_ENABLED
            ESP_LOGI(TAG, "Log write fail count: %" PRIu32, s_insights_data.log_write_fail_cnt);
#endif
            break;

        case ESP_DIAG_DATA_STORE_EVENT_NON_CRITICAL_DATA_WRITE_FAIL:
#if INSIGHTS_DEBUG_ENABLED
            ESP_LOGI(TAG, "Non critical data write failed");
#endif
            break;

        default:
            break;
    }
}

static esp_err_t log_write_cb(void *data, size_t len, void *priv_data)
{
    esp_err_t ret_val = esp_diag_data_store_critical_write(data, len);
#if INSIGHTS_DEBUG_ENABLED
    if (ret_val != ESP_OK) {
        ESP_LOGI(TAG, "esp_diag_data_store_critical_write failed len %d, err 0x%04x", len, ret_val);
    }
#endif
    return ret_val;
}

#if CONFIG_DIAG_ENABLE_METRICS
static esp_err_t metrics_write_cb(const char *group, void *data, size_t len, void *cb_arg)
{
    esp_err_t ret_val = esp_diag_data_store_non_critical_write(group, data, len);
#if INSIGHTS_DEBUG_ENABLED
    if (ret_val != ESP_OK) {
        ESP_LOGI(TAG, "esp_diag_data_store_non_critical_write failed group %s, len %d, err 0x%04x", group, len, ret_val);
    }
#endif
    return ret_val;
}

static void metrics_init(void)
{
    /* Initialize and enable metrics */
    esp_diag_metrics_config_t metrics_config = {
        .write_cb = metrics_write_cb,
        .cb_arg = NULL,
    };
    esp_err_t ret = esp_diag_metrics_init(&metrics_config);
    if (ret == ESP_OK) {
#if CONFIG_DIAG_ENABLE_HEAP_METRICS
        ret = esp_diag_heap_metrics_init();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to initialize heap metrics");
        }
#endif /* CONFIG_DIAG_ENABLE_HEAP_METRICS */
#if CONFIG_DIAG_ENABLE_WIFI_METRICS
        ret = esp_diag_wifi_metrics_init();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to initialize wifi metrics");
        }
#endif /* CONFIG_DIAG_ENABLE_WIFI_METRICS */
        return;
    }
    ESP_LOGE(TAG, "Failed to initialize metrics.");
}

static void metrics_deinit(void)
{
#if CONFIG_DIAG_ENABLE_HEAP_METRICS
    esp_diag_heap_metrics_deinit();
#endif
#if CONFIG_DIAG_ENABLE_WIFI_METRICS
    esp_diag_wifi_metrics_deinit();
#endif
    esp_diag_metrics_deinit();
}
#endif /* CONFIG_DIAG_ENABLE_METRICS */

#if CONFIG_DIAG_ENABLE_VARIABLES
static esp_err_t variables_write_cb(const char *group, void *data, size_t len, void *cb_arg)
{
    return esp_diag_data_store_non_critical_write(group, data, len);
}

static void variables_init(void)
{
    /* Initialize and enable variables */
    esp_diag_variable_config_t variable_config = {
        .write_cb = variables_write_cb,
        .cb_arg = NULL,
    };
    esp_err_t ret = esp_diag_variable_init(&variable_config);
    if (ret == ESP_OK) {
#if CONFIG_DIAG_ENABLE_NETWORK_VARIABLES
        ret = esp_diag_network_variables_init();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to initialize network variables");
        }
#endif /* CONFIG_DIAG_ENABLE_NETWORK_VARIABLES */
        esp_diag_variable_register("diag", KEY_LOG_WR_FAIL, "Log write fail count", "Diagnostics.Log", ESP_DIAG_DATA_TYPE_UINT);
        return;
    }
    ESP_LOGE(TAG, "Failed to initialize param-values.");
}

static void variables_deinit(void)
{
#if CONFIG_DIAG_ENABLE_NETWORK_VARIABLES
    esp_diag_network_variables_deinit();
#endif
    esp_diag_variables_deinit();
}
#endif /* CONFIG_DIAG_ENABLE_VARIABLES */

void esp_insights_disable(void)
{
    s_insights_data.enabled = false;

    esp_insights_unregister_periodic_handler();
#ifdef CONFIG_DIAG_ENABLE_VARIABLES
    variables_deinit();
#endif
#ifdef CONFIG_DIAG_ENABLE_METRICS
    metrics_deinit();
#endif
    esp_diag_log_hook_disable(ESP_DIAG_LOG_TYPE_ERROR | ESP_DIAG_LOG_TYPE_WARNING | ESP_DIAG_LOG_TYPE_EVENT);
    esp_diag_data_store_deinit();
    esp_event_handler_unregister(INSIGHTS_EVENT, ESP_EVENT_ANY_ID, insights_event_handler);
    esp_event_handler_unregister(ESP_DIAG_DATA_STORE_EVENT, ESP_EVENT_ANY_ID, data_store_event_handler);
    if (s_insights_data.data_lock) {
        vSemaphoreDelete(s_insights_data.data_lock);
        s_insights_data.data_lock = NULL;
    }
    if (s_insights_data.scratch_buf) {
        free(s_insights_data.scratch_buf);
        s_insights_data.scratch_buf = NULL;
    }
    if (s_insights_data.data_send_timer) {
        xTimerDelete(s_insights_data.data_send_timer, portMAX_DELAY);
        s_insights_data.data_send_timer = NULL;
    }
    if (s_insights_data.node_id) {
        free(s_insights_data.node_id);
        s_insights_data.node_id = NULL;
    }
}

void esp_insights_deinit(void)
{
    esp_insights_transport_disconnect();
    esp_insights_disable();
    esp_insights_transport_unregister();
    esp_rmaker_work_queue_deinit();
    s_insights_data.init_done = false;
}

/* Use the node id provided by user, if it is NULL and transport is set to MQTT then
 * try to find node id in factory partition. If not found in factory partition or in case
 * of HTTPS transport generate one using mac address
 */
static esp_err_t esp_insights_set_node_id(const char *node_id)
{
    if (node_id) {
        s_insights_data.node_id = strdup(node_id);
        if (!s_insights_data.node_id) {
            return ESP_ERR_NO_MEM;
        }
        return ESP_OK;
    }
#ifdef CONFIG_ESP_INSIGHTS_TRANSPORT_MQTT
    if (esp_rmaker_factory_init() == ESP_OK) {
        s_insights_data.node_id = esp_rmaker_factory_get("node_id");
    }
#endif
    if (!s_insights_data.node_id) {
        uint8_t eth_mac[6];
        if (esp_read_mac(eth_mac, ESP_MAC_WIFI_STA) != ESP_OK) {
            ESP_LOGE(TAG, "Could not fetch MAC address.");
            return ESP_FAIL;
        }
        s_insights_data.node_id = calloc(1, 13); /* 12 bytes for mac + 1 for NULL terminatation */
        if (!s_insights_data.node_id) {
            return ESP_ERR_NO_MEM;
        }
        snprintf(s_insights_data.node_id, 13, "%02X%02X%02X%02X%02X%02X",
                  eth_mac[0], eth_mac[1], eth_mac[2], eth_mac[3], eth_mac[4], eth_mac[5]);
    }
    return ESP_OK;
}

