rednblkx/HomeKey-ESP32/managed_components/espressif__esp_insights/src/esp_insights.c
const char *esp_insights_get_node_id(void)
{
    return s_insights_data.node_id;
}

static esp_err_t esp_insights_read_diag_data_store_crc_from_nvs(uint32_t *crc)
{
    if (!crc) {
        return ESP_ERR_INVALID_ARG;
    }
    nvs_handle_t handle;
    esp_err_t err = nvs_open(INSIGHTS_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return err;
    }
    err = nvs_get_u32(handle, DIAG_DATA_STORE_CRC_KEY, crc);
    nvs_close(handle);
    return err;
}

static esp_err_t esp_insights_set_rtc_crc_in_nvs(uint32_t crc)
{
    if (!crc) {
        return ESP_ERR_INVALID_ARG;
    }
    nvs_handle_t handle;
    esp_err_t err = nvs_open(INSIGHTS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return err;
    }
err = nvs_set_u32(handle, DIAG_DATA_STORE_CRC_KEY, crc);
    nvs_commit(handle);
    nvs_close(handle);
    return err;
}

esp_err_t esp_insights_enable(esp_insights_config_t *config)
{
    esp_err_t err = ESP_OK;
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_insights_data.data_lock) {
        ESP_LOGW(TAG, "Insights already enabled");
        return ESP_OK;
    }
    s_insights_data.data_lock = xSemaphoreCreateMutex();
    if (!s_insights_data.data_lock) {
        ESP_LOGE(TAG, "Failed to create data lock.");
        return ESP_ERR_NO_MEM;
    }
    err = s_insights_data.node_id ? ESP_OK : esp_insights_set_node_id(config->node_id);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set node id");
        goto enable_err;
    }
    if (config->alloc_ext_ram) {
        s_insights_data.scratch_buf = MEM_ALLOC_EXTRAM(INSIGHTS_DATA_MAX_SIZE);
        s_insights_data.read_buf = MEM_ALLOC_EXTRAM(INSIGHTS_READ_BUF_SIZE);
    } else {
        s_insights_data.scratch_buf = malloc(INSIGHTS_DATA_MAX_SIZE);
        s_insights_data.read_buf = malloc(INSIGHTS_READ_BUF_SIZE);
    }
    if (!s_insights_data.scratch_buf) {
        ESP_LOGE(TAG, "Failed to allocate memory for scratch buffer.");
        err = ESP_ERR_NO_MEM;
        goto enable_err;
    }
    if (!s_insights_data.read_buf) {
        ESP_LOGE(TAG, "Failed to allocate memory for read_buf");
        free(s_insights_data.scratch_buf);
        err = ESP_ERR_NO_MEM;
        goto enable_err;
    }

    /* Get sha256 */
    esp_diag_device_info_t device_info;
    memset(&device_info, 0, sizeof(device_info));
    err = esp_diag_device_info_get(&device_info);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get device info");
        goto enable_err;
    }
    memcpy(s_insights_data.app_sha256, device_info.app_elf_sha256, sizeof(s_insights_data.app_sha256));
    err = esp_event_handler_register(INSIGHTS_EVENT, ESP_EVENT_ANY_ID, insights_event_handler, NULL);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register event handler for INSIGHTS_EVENTS");
        goto enable_err;
    }
    /* Register event handler for data store events */
    err = esp_event_handler_register(ESP_DIAG_DATA_STORE_EVENT, ESP_EVENT_ANY_ID, data_store_event_handler, NULL);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register event handler for DIAG_DATA_STORE_EVENT");
        goto enable_err;
    }
    err = esp_diag_data_store_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialise RTC store.");
        goto enable_err;
    }
    uint32_t new_crc, previous_crc;
    new_crc = esp_diag_data_store_get_crc();
    new_crc = esp_crc32_le(esp_diag_data_size_get_crc(), (const unsigned char *)&new_crc, sizeof(new_crc));
    err = esp_insights_read_diag_data_store_crc_from_nvs(&previous_crc);
    if ((err != ESP_OK) || (new_crc != previous_crc)) {
        ESP_LOGI(TAG, "RTC Store configuration changed. Discarding previous data from RTC buffers");
        esp_diag_data_discard_data();
        err = esp_insights_set_rtc_crc_in_nvs(new_crc);
        if (err != ESP_OK) {
            ESP_LOGI(TAG, "Failed to set RTC Store CRC in nvs.");
        }
    }
    esp_diag_log_config_t log_config = {
        .write_cb = log_write_cb,
        .cb_arg = NULL,
    };
    err = esp_diag_log_hook_init(&log_config);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialise Log hook.");
        goto enable_err;
    }
    esp_diag_log_hook_enable(config->log_type);

#if CONFIG_DIAG_ENABLE_METRICS
    metrics_init();
#endif /* CONFIG_DIAG_ENABLE_METRICS */
#if CONFIG_DIAG_ENABLE_VARIABLES
    variables_init();
#endif /* CONFIG_DIAG_ENABLE_VARIABLES */

    s_insights_data.boot_msg_id = -1;
    s_insights_data.data_send_timer = xTimerCreate("data_send_timer", CLOUD_REPORTING_TIMEOUT_TICKS,
                                                   pdFALSE, NULL, data_send_timeout_cb);
    if (!s_insights_data.data_send_timer) {
        ESP_LOGE(TAG, "Failed to create data_send_timer.");
        err = ESP_ERR_NO_MEM;
        goto enable_err;
    }

    err = esp_insights_register_periodic_handler(insights_periodic_handler,
                CLOUD_REPORTING_PERIOD_MIN_SEC, CLOUD_REPORTING_PERIOD_MAX_SEC, NULL);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register insights_periodic_handler.");
        goto enable_err;
    }

    s_insights_data.enabled = true;

    ESP_LOGI(TAG, "=========================================");
    ESP_LOGI(TAG, "Insights enabled for Node ID %s", s_insights_data.node_id);
    ESP_LOGI(TAG, "=========================================");
    s_insights_data.init_done = true;
    return ESP_OK;
enable_err:
    esp_insights_disable();
    return err;
}

esp_err_t esp_insights_init(esp_insights_config_t *config)
{
    esp_err_t err;
    if (s_insights_data.data_lock) {
        ESP_LOGW(TAG, "ESP Insights already initialized");
        return ESP_OK;
    }
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    /* set node id */
    err = esp_insights_set_node_id(config->node_id);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set node id");
        return err;
    }
#ifdef CONFIG_ESP_INSIGHTS_TRANSPORT_MQTT
    err = esp_insights_transport_register(&g_default_insights_transport_mqtt);
#else
    g_default_insights_transport_https.userdata = (void *)config->auth_key;
    err = esp_insights_transport_register(&g_default_insights_transport_https);
#endif
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "Failed to register transport");
        goto init_err;
    }
    err = esp_rmaker_work_queue_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialise Work Queue.");
        goto init_err;
    }
    err = esp_insights_enable(config);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable ESP Insights.");
        goto init_err;
    }
    err = esp_insights_transport_connect();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to connect to transport.");
        goto init_err;
    }
    err = esp_rmaker_work_queue_start();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start Work Queue.");
        goto init_err;
    }

    s_insights_data.init_done = true;
    return ESP_OK;
init_err:
    if (s_insights_data.node_id) {
        free(s_insights_data.node_id);
        s_insights_data.node_id = NULL;
    }
    esp_insights_deinit();
    return err;
}

#endif /* CONFIG_ESP_INSIGHTS_ENABLED */
